// с5: C=a×B, a - const; c7: double; c11: Обчислити суму найменших елементів кожного рядка матриці;
public class lab1 { //оголошую клас lab1
    public static void main(String[] args) { //цей рядок визначає метод main
        double A[][] = { //оголошую та ініціалізую двовимірний масив A типу double, що представляє матрицю.
                {1, 2, 3},
                {4, 5, 6},
                {7, 8, 9},
                {0, -1, -2}};
        double S = 0; //оголошую змінну S типу double і присвоюю їй початкове значення 0, це - сума найменших елементів
        System.out.println("A = "); //виводжу на екран матрицю A.
        for (int j = 0; j < A.length; j++) { //цей цикл перебирає рядки матриці
            for (int i = 0; i < A[j].length; i++) { //а цей - елементи рядка
                System.out.print(A[j][i] + "  ");
            }
            System.out.println();
        }
        double C[][] = A.clone(); // створюю копію матриці А і зберігаю як С
        final int a = 3; // оголошення змінної а, що дорівнює 3, final означає що її значення не можна змінити
        for (int j = 0; j < C.length; j++) { //пербір рядків матриці С
            int l = C[j].length;
            for (int i = 0; i < l; i++) { //перебір елементів рядка
                C[j][i] *= a; //всі елементи матриці множаться на а
            }
        }
        System.out.println("\n" + "a = " + a); //виводжу значення а
        System.out.println("\n" + "C = a*A = "); //виводжу матрицю С
        for (int j = 0; j < C.length; j++) { //перебір рядків матриці С
            for (int i = 0; i < C[j].length; i++) { //перебір елементів рядка
                System.out.print(C[j][i] + "  "); //виводжу матрицю С
            }
            System.out.println();
        }
        for (int i = 0; i < C.length; i++) { //перебір рядків матриці С для знаходження найменшого елементу
            double min = C[i][0];
            for (int j = 1; j < C[i].length; j++) //перебір елементів рядка, починаючи з 2
                if (C[i][j] < min) min = C[i][j]; S += min; //найменші елементи додаються, та формують суму S
        }
        System.out.println("\nСума найменших елементів у кожному рядку дорівнює: " + S); //виводжу шукане значення
    }
}
